<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------
return [
    // 驱动方式
    'type'   => 'File',
    // 缓存保存目录
    'path'   => '',
    // 缓存前缀
    'prefix' => '',
    // 缓存有效期 0表示永久缓存
    'expire' => 0,
];

// return [
//     // 驱动方式
//     'type'   => 'Redis',
//     // 缓存保存目录（File驱动时使用）
//     'path'   => '',
//     // 缓存前缀
//     'prefix' => 'sp_',
//     // 缓存有效期 0表示永久缓存
//     'expire' => 0,
//     // Redis服务器地址
//     'host'   => '127.0.0.1',
//     // Redis服务器端口
//     'port'   => 6379,
//     // Redis密码
//     'password' => '',
//     // Redis数据库索引
//     'select' => 0,
//     // 连接超时时间（毫秒）
//     'timeout' => 0,
//     // 是否长连接
//     'persistent' => false,
// ];
